mo10/n32g031-cmake-template/svd/N32G031.svd
                <register>
                    <name>ADC_RSEQ1</name>
                    <displayName>ADC_RSEQ1</displayName>
                    <description>ADC_RSEQ1</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEQ13</name>
                            <description>SEQ13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ14</name>
                            <description>SEQ14</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ15</name>
                            <description>SEQ15</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ16</name>
                            <description>SEQ16</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>LEN</name>
                            <description>LEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_RSEQ2</name>
                    <displayName>ADC_RSEQ2</displayName>
                    <description>ADC_RSEQ2</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3fffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEQ7</name>
                            <description>SEQ7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ8</name>
                            <description>SEQ8</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ9</name>
                            <description>SEQ9</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ10</name>
                            <description>SEQ10</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ11</name>
                            <description>SEQ11</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ12</name>
                            <description>SEQ12</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_RSEQ3</name>
                    <displayName>ADC_RSEQ3</displayName>
                    <description>ADC_RSEQ3</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3fffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEQ1</name>
                            <description>SEQ1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ2</name>
                            <description>SEQ2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ3</name>
                            <description>SEQ3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ4</name>
                            <description>SEQ4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ5</name>
                            <description>SEQ5</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SEQ6</name>
                            <description>SEQ6</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JSEQ</name>
                    <displayName>ADC_JSEQ</displayName>
                    <description>ADC_JSEQ</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>JSEQ1</name>
                            <description>JSEQ1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>JSEQ2</name>
                            <description>JSEQ2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>JSEQ3</name>
                            <description>JSEQ3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>JSEQ4</name>
                            <description>JSEQ4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>JLEN</name>
                            <description>JLEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JDAT1</name>
                    <displayName>ADC_JDAT1</displayName>
                    <description>ADC_JDAT1</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>JDAT1</name>
                            <description>JDAT1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JDAT2</name>
                    <displayName>ADC_JDAT2</displayName>
                    <description>ADC_JDAT2</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>JDAT2</name>
                            <description>JDAT2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JDAT3</name>
                    <displayName>ADC_JDAT3</displayName>
                    <description>ADC_JDAT3</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>JDAT3</name>
                            <description>JDAT3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_JDAT4</name>
                    <displayName>ADC_JDAT4</displayName>
                    <description>ADC_JDAT4</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>JDAT4</name>
                            <description>JDAT4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_DAT</name>
                    <displayName>ADC_DAT</displayName>
                    <description>ADC_DAT</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT</name>
                            <description>DAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CTRL3</name>
                    <displayName>ADC_CTRL3</displayName>
                    <description>ADC_CTRL3</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <resetMask>0x00000377</resetMask>
                    <fields>
                        <field>
                            <name>REFSEL</name>
                            <description>REFSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VREFEN</name>
                            <description>VREFEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VREFRDY</name>
                            <description>VREFRDY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CKMOD</name>
                            <description>CKMOD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>RDY</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDRDY</name>
                            <description>PDRDY</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDCAIEN</name>
                            <description>ENDCAIEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JENDCAIEN</name>
                            <description>JENDCAIEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_OPACTRL</name>
                    <displayName>ADC_OPACTRL</displayName>
                    <description>ADC_OPACTRL</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x02ffffff</resetMask>
                    <fields>
                        <field>
                            <name>JSQ1_OPAEN</name>
                            <description>JSQ1_OPAEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JSQ2_OPAEN</name>
                            <description>JSQ2_OPAEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JSQ3_OPAEN</name>
                            <description>JSQ3_OPAEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JSQ4_OPAEN</name>
                            <description>JSQ4_OPAEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JSQ1_OPASEL</name>
                            <description>JSQ1_OPASEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>JSQ2_OPASEL</name>
                            <description>JSQ2_OPASEL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>JSQ3_OPASEL</name>
                            <description>JSQ3_OPASEL</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>JSQ4_OPASEL</name>
                            <description>JSQ4_OPASEL</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OPA_SETUP_TIME</name>
                            <description>OPA_SETUP_TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
