mo10/n32g031-cmake-template/svd/N32G031.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2</name>
                <description>I2C2 Global interrupt</description>
                <value>24</value>
            </interrupt>  
		</peripheral>

        <peripheral>
            <name>IWDG</name>
            <description>Independent watchdog</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDG_KEY</name>
                    <displayName>IWDG_KEY</displayName>
                    <description>IWDG_KEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>KEYV</name>
                            <description>KEYV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_PREDIV</name>
                    <displayName>IWDG_PREDIV</displayName>
                    <description>IWDG_PREDIV</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_RELV</name>
                    <displayName>IWDG_RELV</displayName>
                    <description>IWDG_RELV</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000fff</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>REL</name>
                            <description>REL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_STS</name>
                    <displayName>IWDG_STS</displayName>
                    <description>IWDG_STS</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>PVU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRVU</name>
                            <description>CRVU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>		
	    </peripheral>

		<peripheral>
            <name>LPTIM</name>
            <description>Low power timer control</description>
            <groupName>LPTIM</groupName>
            <baseAddress>0x40000C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPTIM_TIM6</name>
                <description>LPTIM / TIM6 global Interrupts</description>
                <value>20</value>
            </interrupt>
            <registers>
                <register>
                    <name>LPTIM_INTSTS</name>
                    <displayName>LPTIM_INTSTS</displayName>
                    <description>LPTIM_INTSTS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>CMPM</name>
                            <description>CMPM</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRM</name>
                            <description>ARRM</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTRIG</name>
                            <description>EXTRIG</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMPUPD</name>
                            <description>CMPUPD</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRUPD</name>
                            <description>ARRUPD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UP</name>
                            <description>UP</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOWN</name>
                            <description>DOWN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTIM_INTCLR</name>
                    <displayName>LPTIM_INTCLR</displayName>
                    <description>LPTIM_INTCLR</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>CMPMCF</name>
                            <description>CMPMCF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRMCF</name>
                            <description>ARRMCF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTRIGCF</name>
                            <description>EXTRIGCF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMPUPDCF</name>
                            <description>CMPUPDCF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRUPDCF</name>
                            <description>ARRUPDCF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPCF</name>
                            <description>UPCF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOWNCF</name>
                            <description>DOWNCF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPTIM_INTEN</name>
                    <displayName>LPTIM_INTEN</displayName>
                    <description>LPTIM_INTEN</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007f</resetMask>
                    <fields>
                        <field>
                            <name>CMPMIE</name>
                            <description>CMPMIE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRMIE</name>
                            <description>ARRMIE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTRIGIE</name>
                            <description>EXTRIGIE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMPUPDIE</name>
                            <description>CMPUPDIE</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRUPDIE</name>
                            <description>ARRUPDIE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPIE</name>
                            <description>UPIE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOWNIE</name>
                            <description>DOWNIE</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>		
	                <name>LPTIM_CFG</name>
                    <displayName>LPTIM_CFG</displayName>
                    <description>LPTIM_CFG</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x03feeeef</resetMask>
                    <fields>
                        <field>
                            <name>CLKSEL</name>
                            <description>CLKSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKPOL</name>
                            <description>CLKPOL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLKFLT</name>
                            <description>CLKFLT</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TRIGFLT</name>
                            <description>TRIGFLT</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLKPRE</name>
                            <description>CLKPRE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TRGSEL</name>
                            <description>TRGSEL</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TRGEN</name>
                            <description>TRGEN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIMOUTEN</name>
                            <description>TIMOUTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>WAVE</name>
                            <description>WAVE</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>		
                        <field>
                            <name>WAVEPOL</name>
                            <description>WAVEPOL</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>RELOAD</name>
                            <description>RELOAD</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>CNTMEN</name>
                            <description>CNTMEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>ENC</name>
                            <description>ENC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>NENC</name>
                            <description>NENC</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>							
                    </fields>
                </register>
                <register>	
		            <name>LPTIM_CTRL</name>
                    <displayName>LPTIM_CTRL</displayName>
                    <description>LPTIM_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>LPTIMEN</name>
                            <description>LPTIMEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SNGMST</name>
                            <description>SNGMST</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSTCM</name>
                            <description>TSTCM</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
	                </fields>
                </register>
                <register>	
		            <name>LPTIM_CMP</name>
                    <displayName>LPTIM_CMP</displayName>
                    <description>LPTIM_CMP</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPVAL</name>
                            <description>CMPVAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
	                </fields>
                </register>
                <register>	
			         <name>LPTIM_ARR</name>
                    <displayName>LPTIM_ARR</displayName>
                    <description>LPTIM_ARR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>ARRVAL</name>
                            <description>ARRVAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
	                </fields>
                </register>
                <register>				
			         <name>LPTIM_CNT</name>
                    <displayName>LPTIM_CNT</displayName>
                    <description>LPTIM_CNT</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CNTVAL</name>
                            <description>CNTVAL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
	                </fields>
                </register>
